# python
brew "pyenv"
brew "pyenv-virtualenvwrapper"
brew "pipx"
brew "automake"
brew "libtool"

# cli tools
brew "wget"
brew "jq"


# dev tools
brew "shellcheck"
cask "beyond-compare"


# for vscode symbol generation
brew "ctags"
brew "nbdime"
tap "jabley/homebrew-wrk2"
brew "wrk2", args: ["HEAD"]
brew "pandoc"


# node
brew "node"
brew "yarn"
brew "Schniz/tap/fnm"

# install mac apps
cask "iterm2"
cask "slack" unless system "[[ -d '/Applications/Slack.app' ]]"
cask "visual-studio-code"

